-$(document).ready(function () {
	// Mask for tel-input
	$('.form__input--mask').mask('+998 11 111 11 11');
	$('.form__input--mask').on('focus', function () {
		$('.form__input--mask').val('+998');
	});
	$('.input-file input[type=file]').on('change', function () {
		let file = this.files[0];
		$(this).next().html(file.name);
	});
	function limitTextLength(inputElem) {
		let symbolsRemaining = 0;
		$(inputElem).each(function () {
			let attr = $(this).attr('maxlength');
			if (typeof attr !== 'undefined' && attr !== false) {
				let countingBlock = $(this).prev().children().children();
				$(this).on('input', function () {
					symbolsRemaining = $(this).attr('maxlength') - $(this).val().length;
					countingBlock.text(symbolsRemaining);
				});
				$(this).on('keydown', function () {
					if (symbolsRemaining <= 0) {
						countingBlock.addClass('over-limit');
						setTimeout(function () {
							countingBlock.removeClass('over-limit');
						}, 100);
					}
				});
			}
		});
	}
	$('[href^="#"]').on('click', function () {
		let href = $(this).attr('href'),
			elem = $(document).find(href);
		if (elem.length > 0) {
			let posY = elem.eq(0).offset().top;
			$('html, body').animate(
				{
					scrollTop: posY,
				},
				1000
			);
		}
		return false;
	});
});
window.addEventListener('resize', () => calcHeaderHeight());
window.addEventListener('load', () => {
	const mobileBurger = () => {
		const openBtn = document.querySelector('.aside__open-btn');
		const closeBtn = document.querySelector('.aside__close-btn');
		const menu = document.querySelector('.aside');

		openBtn.addEventListener('click', () => {
			menu.classList.add('active');
			document.body.style.overflow = 'hidden';
		});

		closeBtn.addEventListener('click', () => {
			menu.classList.remove('active');
			document.body.style.overflow = '';
		});
	};
	const openModal = (modal) => {
		modal.classList.add('active');
		document.body.style.overflow = 'hidden';
	};
	const closeModal = (modal) => {
		modal.classList.remove('active');
		document.body.style.overflow = '';
	};
	const modalFunction = (modalClass, openModalButtonsClass, closeModalButtonsClass) => {
		const modal = document.querySelector(modalClass);
		const openModalButtons = document.querySelectorAll(openModalButtonsClass);
		const closeModalButtons = document.querySelectorAll(closeModalButtonsClass);
		openModalButtons.forEach((btn) => {
			btn.addEventListener('click', () => {
				openModal(modal);
			});
		});
		closeModalButtons.forEach((btn) => {
			btn.addEventListener('click', () => {
				closeModal(modal);
			});
		});
	};
	mobileBurger();
	modalFunction('.exit-modal', '.open-exit-modal', '.close-exit-modal');
	modalFunction('.delete-modal', '.open-delete-modal', '.close-delete-modal');
});

function openTab(evt, tabName) {
	var i, tabcontent, tablinks;
	tabcontent = document.getElementsByClassName('tabcontent');
	for (i = 0; i < tabcontent.length; i++) {
		tabcontent[i].style.display = 'none';
	}
	tablinks = document.getElementsByClassName('tablinks');
	for (i = 0; i < tablinks.length; i++) {
		tablinks[i].className = tablinks[i].className.replace(' tabs__active', '');
	}
	document.getElementById(tabName).style.display = 'block';
	evt.currentTarget.className += ' tabs__active';
}

let fields = document.querySelectorAll('.field__file');
Array.prototype.forEach.call(fields, function (input) {
	let label = input.nextElementSibling,
		labelVal = label.querySelector('.field__file-fake').innerText;

	input.addEventListener('change', function (e) {
		let countFiles = '';
		if (this.files && this.files.length >= 1) countFiles = this.files.length;

		if (countFiles) label.querySelector('.field__file-fake').innerText = 'Выбрано файлов: ' + countFiles;
		else label.querySelector('.field__file-fake').innerText = labelVal;
	});
});

$('.add-flat').on('click', function () {
	const temp = $(`
    <div id="flat">
        <div class="row mt-4" >
            <div class="col-4">
                <label for="">Количество квартир</label>
                <input type="text" name="flat_number[]" placeholder="Введите текст" required>
            </div>
            <div class="col-4">
                <label for="">При наличии корпуса укзать название</label>
                <input type="text" name="flat_ru[]" placeholder="Введите текст" required>
            </div>
            <div class="col-4">
                <label for="">При наличии корпуса укзать название</label>
                <input type="text" name="flat_uz[]" placeholder="Введите текст" required>
            </div>
        </div>
        <div class="col-12 d-flex justify-content-end botton-hr">
            <div class="del-text mt-3" style="cursor: pointer">
                <svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
                </svg>
                Удалить
            </div>
        </div>
    </div>
      `);
	temp.insertAfter('#flat');
	$('.row').prev().removeAttr('flat');
	$('.del-text').on('click', function () {
		$(this).parent().parent().remove();
	});
});
$('.add-facilities').on('click', function () {
	const temp = $(`
    <div class="row" id="facilities">
		<div class="col-6">
			<label for="">Название RU</label>
			<input type="text" name="faci_ru[]" placeholder="Супермаркет Magnum" required>
		</div>
		<div class="col-6">
			<label for="">Название UZ</label>
			<input type="text" name="faci_uz[]" placeholder="Supermarket Magnum" required>
		</div>
		<div class="col-6">
			<label for="">Расстояние от комплекса (км)</label>
			<input type="text" name="faci_km[]" placeholder="0,5" required>
		</div>
		<div class="content__bg--title">
			Фото превью
		</div>
		<div class="col-3">
			<div class="content__bg--img d-flex align-items-center">
				<div class="contetn__bg--img-edit">
					<img src="/admin/images/2.jpg" alt="" data-img>
				</div>
				<label class="input-file">
					<input type="file" name="faci_img[]" data-input="change" required>
					<span class="edit-btn-small field__file-fake">
						<svg width="17" height="20">
							<use xlink:href="/admin/icons/sprite.svg#icon-edit-green"></use>
						</svg>
						Редактировать
					</span>
				</label>
			</div>
		</div>
		<div class="col-12 d-flex justify-content-end botton-hr mb-3">
			<button class="del-text">
				<svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
				</svg>
				Удалить
			</button>
    	</div>
	</div>
      `);
	temp.insertAfter('#facilities');
	$('.row').prev().removeAttr('facilities');
	$('.del-text').on('click', function () {
		$(this).parent().parent().remove();
	});
});

$('.add-plan').on('click', function () {
	const temp = $(`
    <div class="row" id="plan">
		<div class="col-6">
			<label for="">Тип:</label>
			<select name="layout_select[]" id="">
				<option value="1">1 - комн. квартиры</option>
				<option value="2">2 - комн. квартиры</option>
				<option value="3">3 - комн. квартиры</option>
				<option value="4">4 - комн. квартиры</option>
				<option value="5">5 - комн. квартиры</option>
			</select>
		</div>
		<div class="row mt-1">
			<div class="col-6">
				<label for="">Название RU</label>
				<input type="text" name="layout_ru[]" placeholder="1 - комнатная квартира, план №1" required>
			</div>
			<div class="col-6">
				<label for="">Название UZ</label>
				<input type="text" name="layout_uz[]" placeholder="1 - комнатная квартира, план №1" required>
			</div>
			<div class="col-3">
				<div class="content__bg--img d-flex align-items-center">
					<div class="contetn__bg--img-edit">
						<img src="/admin/images/2.jpg" alt="" data-img>
					</div>
					<label class="input-file">
						<input type="file" name="layout_img[]" data-input="change" required>
						<span class="edit-btn-small field__file-fake">
							<svg width="17" height="20">
								<use xlink:href="/admin/icons/sprite.svg#icon-edit-green"></use>
							</svg>
							Редактировать
						</span>
					</label>
				</div>
			</div>
		</div>
		<div class="row">
			<div class="col-6">
				<label for="">Стоимость (сум)</label>
				<input type="text" name="layout_price[]" placeholder="32 000 000" required>
			</div>
			<div class="col-6">
				<label for="">Площадь (м2)</label>
				<input type="text" name="layout_square[]" placeholder="54" required>
			</div>
			<div class="col-12 d-flex justify-content-end">
				<button class="del-text">
					<svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
						<path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
					</svg>
					Удалить
				</button>
			</div>
			<div class="col-12 d-flex justify-content-end botton-hr p-0"></div>
		</div>
	</div>
      `);
	temp.insertAfter('#plan');
	$('.row').prev().removeAttr('plan');
	$('.del-text').on('click', function () {
		$(this).parent().parent().parent().remove();
	});
});

$('.add-photo').on('click', function () {
	const temp = $(`
   <div class="col-12 col-md-2" id="photo">
		<div class="content__bg--img d-flex flex-column" style="gap: 10px">
			<img src="/admin/images/2.jpg" alt="" data-img>
				<label class="input-file">
					<input type="file" name="photo[]" data-input="change" required>
					<span class="edit-btn-small field__file-fake">
						<svg width="17" height="20">
							<use xlink:href="/admin/icons/sprite.svg#icon-edit-green"></use>
						</svg>
						Редактировать
					</span>
				</label>
			<div class="del-text justify-content-start">
				<svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
				</svg>
				Удалить
			</div>
		</div>
	</div>
    `);
	temp.insertAfter('#photo');
	$('.row').prev().removeAttr('photo');
	$('.del-text').on('click', function () {
		$(this).parent().parent().remove();
	});
});
$('.add-slide').on('click', function () {
	const temp = $(`
   <div class="col-12 col-md-2" id="photo">
		<div class="content__bg--img content__bg--video d-flex flex-column" style="gap: 10px">
			<img src="/admin/images/2.jpg" alt="" data-img>
				<label class="input-file">
					<input type="file" name="slide[]" data-input="change" required>
					<span class="edit-btn-small field__file-fake">
						<svg width="17" height="20">
							<use xlink:href="/admin/icons/sprite.svg#icon-edit-green"></use>
						</svg>
						Редактировать
					</span>
				</label>
			<div class="del-text justify-content-start">
				<svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
				</svg>
				Удалить
			</div>
		</div>
	</div>
    `);
	temp.insertAfter('#photo');
	$('.row').prev().removeAttr('photo');
	$('.del-text').on('click', function () {
		$(this).parent().parent().remove();
	});
});
$('.add-photo').on('click', function () {
	const temp = $(`
    <div class="col-12 col-md-3" id="photo-2">
		<div class="content__bg--img content__bg--video d-flex flex-column" style="gap: 10px">
			<img src="/assets/images/2.jpg" alt="">
			<form action="">
				<label class="input-file">
					<input type="file" name="preview" required>
					<span class="edit-btn-small field__file-fake">
						<svg width="17" height="20">
							<use xlink:href="/assets/icons/sprite.svg#icon-edit-green"></use>
						</svg>
						Редактировать
					</span>
				</label>
			</form>
			<a href="#!" class="del-text justify-content-start">
				<svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
				</svg>
				Удалить
			</a>
		</div>
	</div>
    `);
	temp.insertAfter('#photo-2');
	$('.row').prev().removeAttr('photo');
	$('.del-text').on('click', function () {
		$(this).parent().parent().remove();
	});
});
$('.add-manager').on('click', function () {
	const temp = $(`
	<div class="row align-items-center mt-2" id="manager">
		<div class="col-12 col-lg-5">
			<label for="">Юзернейм менеджера</label>
			<input type="text" placeholder="@Study1_Vasiliya">
		</div>
		<div class="col-1">
			<button class="del-text">
				<svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
				</svg>
				Удалить
			</button>
		</div>
	</div>
    `);
	temp.insertAfter('#manager');
	$('.row').prev().removeAttr('manager');
	$('.del-text').on('click', function () {
		$(this).parent().parent().remove();
	});
});
$('.add-tilte').on('click', function () {
	const temp = $(`
	<div class="content__bg ">
		<div class="row justify-content-end">
			<div class="col-12">
                <label for="">Подзаголовок 1 RU</label>
                <input type="text" name="subtitle_ru[]" placeholder="Введите текст">
            </div>
            <div class="col-12">
                <label for="">Подзаголовок 1 UZ</label>
                <input type="text" name="subtitle_uz[]" placeholder="Введите текст">
            </div>
			<div class="col-1">
			<button class="del-text">
				<svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
				</svg>
				Удалить
			</button>
			</div>
		</div>
	</div>
    `);
	temp.insertAfter('#tilte');
	$('.row').prev().removeAttr('tilte');
	$('.del-text').on('click', function () {
		$(this).parent().parent().parent().remove();
	});
});
$('.abz').on('click', function () {
	const temp = $(`
	<div class="content__bg id="abz"">
	<div class="row justify-content-end">
		<div class="col-12">
            <label for="">Абзац 1 RU</label>
            <textarea name="article_ru[]" id="" required></textarea>
        </div>
        <div class="col-12">
            <label for="">Абзац 1 UZ</label>
            <textarea name="article_uz[]" id="" required></textarea>
        </div>
		<div class="col-1">
			<button class="del-text">
				<svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
				</svg>
				Удалить
			</button>
		</div>
		</div>
</div>
    `);
	temp.insertAfter('#abz');
	$('.row').prev().removeAttr('abz');
	$('.del-text').on('click', function () {
		$(this).parent().parent().parent().remove();
	});
});
$('.add-foto').on('click', function () {
	const temp = $(`
	<div class="content__bg">
		<div class="row">
			<div class="col-12" >
				<div class="content__bg--title">
				     Фото статьи
				</div>
				<div class="content__bg--img d-flex align-items-center">
					<div class="contetn__bg--img-edit">
						<img src="/admin/images/2.jpg" alt="" data-img>
					</div>
					<label class="input-file">
						<input type="file" name="photo[]" data-input="change">
						<span class="edit-btn-small field__file-fake">
							<svg width="17" height="20">
								<use xlink:href="/assets/icons/sprite.svg#icon-edit-green"></use>
							</svg>
							Редактировать
						</span>
					</label>
				</div>
			</div>
			<div class="col-12">
				<button class="del-text">
					<svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
						<path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
					</svg>
					Удалить
				</button>
			</div>
		</div>
	</div>
    `);
	temp.insertAfter('#add-foto');
	$('.row').prev().removeAttr('add-foto');
	$('.del-text').on('click', function () {
		$(this).parent().parent().parent().remove();
	});
});
$('.add-vidoe').on('click', function () {
	const temp = $(`
	<div class="content__bg">
		<div class="row">
			 <div class="col-12 col-md-3">
                <div class="content__bg--title">
                    Превью видео
                </div>
                <div class="content__bg--img content__bg--video" >
                    <img src="/admin/images/2.jpg" alt="" data-img>
                    <label class="input-file">
                        <input type="file" name="video[]" data-input="change">
                        <span class="edit-btn-small field__file-fake">
                            <svg width="17" height="20">
                                <use xlink:href="/admin/icons/sprite.svg#icon-edit-green"></use>
                            </svg>
                            Редактировать
                        </span>
                    </label>
                </div>
            </div>
            <div class="col-12 col-md-7">
                <div class="content__bg--title">
                    Видео
                </div>
                <div class="">
                    <label for="">Ссылка на видео</label>
                    <input type="text" name="link[]"  placeholder="https://youtu.be/B-mIhg7nHBk">
                </div>
            </div>
			<div class="col-12">
			<button class="del-text">
				<svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
				</svg>
				Удалить
			</button>
			</div>
		</div>
	</div>
    `);
	temp.insertAfter('#add-vidoe');
	$('.row').prev().removeAttr('add-vidoe');
	$('.del-text').on('click', function () {
		$(this).parent().parent().parent().remove();
	});
});
$('.add-block').on('click', function () {
	const temp = $(`
	<div class="row mt-1" id="block">
		<div class="col-6">
			<label for="">Особенность 1 RU</label>
			<input type="text" name="special_ru[]" placeholder="Архитектура" required>
		</div>
		<div class="col-6">
			<label for="">Особенность 1 RU</label>
			<input type="text" name="special_uz[]" placeholder="Архитектура" required>
		</div>
		<div class="col-3">
			<div class="content__bg--img d-flex align-items-center">
				<div class="contetn__bg--img-edit">
					<img src="/admin/images/2.jpg" alt="" data-img>
				</div>
				<label class="input-file">
					<input type="file" name="special_img[]" data-input="change" required>
					<span class="edit-btn-small field__file-fake">
						<svg width="17" height="20">
							<use xlink:href="/admin/icons/sprite.svg#icon-edit-green"></use>
						</svg>
						Редактировать
					</span>
				</label>
			</div>
		</div>
		<div class="col-12 d-flex justify-content-end">
			<button class="del-text">
				<svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
				</svg>
				Удалить
			</button>
		</div>
	</div>
    `);
	temp.insertAfter('#block');
	$('.row').prev().removeAttr('block');
	$('.del-text').on('click', function () {
		$(this).parent().parent().remove();
	});
});
$('.add-foto-gallery').on('click', function () {
    const temp = $(`
			<div class="col-3">
				<div class="content__bg--img content__bg--video d-flex flex-column align-items-center">
					<div class="contetn__bg--img-edit">
						<img src="/admin/images/2.jpg" alt="" data-img>
					</div>
					<label class="input-file">
						<input type="file" name="gallery_img[]" data-input="change">
						<span class="edit-btn-small field__file-fake">
							<svg width="17" height="20">
								<use xlink:href="/admin/icons/sprite.svg#icon-edit-green"></use>
							</svg>
							Редактировать
						</span>
					</label>
                    <div class="del-text">
                        <svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M6.21401 3.28561H9.78544C9.78544 2.81201 9.5973 2.35781 9.26241 2.02292C8.92753 1.68803 8.47332 1.4999 7.99972 1.4999C7.52612 1.4999 7.07192 1.68803 6.73703 2.02292C6.40214 2.35781 6.21401 2.81201 6.21401 3.28561ZM5.14258 3.28561C5.14258 2.52785 5.4436 1.80112 5.97942 1.2653C6.51523 0.729486 7.24196 0.428467 7.99972 0.428467C8.75748 0.428467 9.48421 0.729486 10.02 1.2653C10.5558 1.80112 10.8569 2.52785 10.8569 3.28561H15.3211C15.4632 3.28561 15.5995 3.34205 15.7 3.44252C15.8004 3.54298 15.8569 3.67924 15.8569 3.82132C15.8569 3.9634 15.8004 4.09967 15.7 4.20013C15.5995 4.3006 15.4632 4.35704 15.3211 4.35704H14.3854L13.5161 14.7878C13.4529 15.5466 13.1068 16.2539 12.5465 16.7695C11.9862 17.2851 11.2526 17.5713 10.4912 17.5713H5.50829C4.74686 17.5713 4.01325 17.2851 3.45294 16.7695C2.89263 16.2539 2.54654 15.5466 2.48329 14.7878L1.61401 4.35704H0.678292C0.536212 4.35704 0.399951 4.3006 0.299485 4.20013C0.199019 4.09967 0.142578 3.9634 0.142578 3.82132C0.142578 3.67924 0.199019 3.54298 0.299485 3.44252C0.399951 3.34205 0.536212 3.28561 0.678292 3.28561H5.14258ZM6.92829 7.39275C6.92829 7.25067 6.87185 7.11441 6.77139 7.01395C6.67092 6.91348 6.53466 6.85704 6.39258 6.85704C6.2505 6.85704 6.11424 6.91348 6.01377 7.01395C5.91331 7.11441 5.85686 7.25067 5.85686 7.39275V13.4642C5.85686 13.6063 5.91331 13.7425 6.01377 13.843C6.11424 13.9435 6.2505 13.9999 6.39258 13.9999C6.53466 13.9999 6.67092 13.9435 6.77139 13.843C6.87185 13.7425 6.92829 13.6063 6.92829 13.4642V7.39275ZM9.60686 6.85704C9.46478 6.85704 9.32852 6.91348 9.22806 7.01395C9.12759 7.11441 9.07115 7.25067 9.07115 7.39275V13.4642C9.07115 13.6063 9.12759 13.7425 9.22806 13.843C9.32852 13.9435 9.46478 13.9999 9.60686 13.9999C9.74894 13.9999 9.88521 13.9435 9.98567 13.843C10.0861 13.7425 10.1426 13.6063 10.1426 13.4642V7.39275C10.1426 7.25067 10.0861 7.11441 9.98567 7.01395C9.88521 6.91348 9.74894 6.85704 9.60686 6.85704Z" fill="#BF4D4D" />
                        </svg>
                        Удалить
                    </div>
				</div>
			</div>
    `);
    temp.insertAfter('#add-foto-gallery');
    $('.row').prev().removeAttr('add-foto-gallery');
    $('.del-text').on('click', function () {
        $(this).parent().parent().remove();
    });
});

